app/controllers/greetings_controller.rb

SELECT "greetings".* FROM "greetings"
---
    def random_greeting
      @random_greeting = Greeting.all.sample